<script setup lang="ts">
import type { FindShiciInfoReponse } from '~/api'
import { showMetaDetail } from '~/state'

// baseInfo = {
//   ...test1,
// }

const props = withDefaults(defineProps<{
  baseInfo: FindShiciInfoReponse
}>(), {
})

const {
  baseInfo,
} = props
const test2 = {
  authorName: '杜甫',
  kindCN: '诗',
  baiduWiki: 'http://baike.baidu.com/subview/71593/5128543.htm',
  appreciation: '少陵的《佳人》既反映客观存在的社会问题，又体现了诗人的主观寄托。诗中人物悲惨的命运与高尚的情操形成了强烈的对照，既让人同情，又令人敬佩。诗人用「赋」的手法描写佳人悲苦的生活，同时用「比兴」的手法赞美了她高洁的品格。全诗含蓄蕴藉，耐人寻味，感人肺腑，能强烈地引起读者的共鸣，是杜诗中的佳作。\r\n全诗分三段，每段八句。第一段写佳人家庭的不幸遭遇。第二段，佳人倾诉被丈夫抛弃的大不幸。第三段，赞美佳人虽遭不幸，尚能洁身自持的高尚情操。\r\n「绝代有佳人，幽居在空谷。自云良家子，零落依草木。」开头两句点题，上句写其貌之美，下句写其品之高。又以幽居的环境，衬出佳人的孤寂，点出佳人命运之悲，处境之苦，隐含着诗人「同是天涯沦落人」的慨叹。以上四句是是第三人称的描状，笔调含蓄蕴藉。\r\n「关中昔丧乱，兄弟遭杀戮。官高何足论，不得收骨肉。」从此处以下转为第一人称的倾诉，语气率直酣畅。当年安史之乱，长安沦陷，兄弟们惨遭杀戮。官位高也没有什么用，他们死後连屍骨都得不到收殓。天宝十五载（西元七五六年）六月，安史叛军攻陷长安。「官高」呼应上文的「良家子」，强调绝代佳人出自贵人之家。\r\n「世情恶衰歇，万事随转烛。夫婿轻薄儿，新人美如玉。」这四句托物兴感，刻画世态炎凉，人情冷暖。宋代的刘辰翁评论说：「闲言余语，无不可感。」「转烛」，以风中的烛光，飘摇不定，比喻世事转变、光景流逝的迅速。\r\n「合昏尚知时，鸳鸯不独宿。但见新人笑，那闻旧人哭。」诗人以形象的比喻，写负心人的无义绝情，被抛弃的人伤心痛苦。在佳人倾诉个人不幸、慨叹世情冷漠的言辞中，充溢着悲愤不平的情绪。一「新」一「旧」、一「笑」一「哭」，强烈对照，被遗弃女子声泪俱下的痛苦之状，如在目前。夜合花朝开夜合，所以说「知时」。鸳鸯则多雌雄成对，生活在水边。\r\n「在山泉水清，出山泉水浊。侍婢卖珠回，牵萝补茅屋。」这几句似悲似诉，佳人自言自誓，有矜持慷慨、修洁端丽之意。同时，可见佳人居家环境的简陋清幽，生活的清贫困窘。浦起龙评论说：「这二句，可谓贞士之心，化人之舌，建安而下无此语也。」它出自《诗经·小雅·四月》：「相彼泉水，载清载浊。」但在这首诗中，有多种解释，都有一定的道理。或以新人旧人为清浊，或以前华後憔为清浊，或以在家弃外为清浊，或以守贞为清、改节为浊。还有人认为：佳人以泉水自喻，以山喻夫婿之家，意思是妇人为夫所爱，世人便认为她是清的；为夫所弃，世人便认为她是浊的。另一种解释是佳人怨其夫之辞。人处空谷幽寂之地，就像泉水在山，没有什么能影响其清澈。佳人的丈夫出山，随物流荡，于是就成了山下的浊泉。而她则宁肯受饥寒，也不愿再嫁，成为那浊泉。这就像晋代孙绰《三日兰亭诗序》所说的那样：「古人以水喻性，有旨哉斯谈！非以停之则清，混之则浊邪？情因所习而迁移，物触所遇而兴感。」\r\n「摘花不插发，采柏动盈掬。天寒翠袖薄，日暮倚修竹。」末尾几句以写景作结，刻画出佳人的孤高和绝世而立，画外有意，象外有情。在体态美中，透露着意态美。这种美，不衹是一种女性美，也是古代士大夫追求的一种理想美。诗句暗示读者，这位时乖命蹇的女子，就像那经寒不凋的翠柏、挺拔劲节的绿竹，有着高洁的情操。诗的最後两句，为後人激赏，妙在对美人容貌不着一字形容，仅凭「翠袖」、「修竹」这一对色泽清新而寓有兴寄的意象，与天寒日暮的山中环境相融合，便传神地刻画出佳人不胜清寒、孤寂无依的幽姿高致。\r\n这首五言古体诗，从开篇一路下来，都是「说」，到了结尾两句，才以一幅画面忽然结束。作者的高明之处，就在这裏。他没有拿一个结局去迁就读者的胃口，而是用一个悬念故意吊着读者的胃口。读过这首诗的人，一闭上眼睛，就会在脑海裏浮现出这样的画面：一位绝世美貌却格外不幸的佳人，在秋风中，在黄昏裏，衣裳单薄，孤伶伶地站在那裏，背靠着一丛竹，眼裏流露着哀愁。\r\n在古代，以弃妇为题材的诗文不乏佳作。如《诗经》裏的《卫风·氓》，汉乐府裏的《上山采蘼芜》等，而司马相如的《长门赋》写被废弃的陈皇后，其中「夫何一佳人兮，步逍遥以自娱」两句，正是少陵《佳人》诗题的来源。少陵很少写专咏美人的诗歌，《佳人》却以其格调之高而成为咏美人的名篇。山中清泉见其品质之清，侍婢卖珠见其生计之贫，牵萝补屋见其隐居之志，摘花不戴见其朴素无华，采柏盈掬见其情操贞洁，日暮倚竹见其清高寂寞。诗人以纯客观叙述方法，兼采夹叙夹议和形象比喻等手法，描述了一个在战乱时期被遗弃的上层社会妇女所遭遇的不幸，并在逆境中揭示她的高尚情操，从而使这个人物形象更加丰满。',
  dynasty: '唐',
  layout: 'center',
  content: '绝代有佳人，幽居在空谷。\r\n自云良家子，零落依草木。\r\n关中昔丧乱，兄弟遭杀戮。\r\n官高何足论，不得收骨肉。\r\n世情恶衰歇，万事随转烛。\r\n夫壻轻薄儿，新人美如玉。\r\n合昏尚知时，鸳鸯不独宿。\r\n但见新人笑，那闻旧人哭。\r\n在山泉水清，出山泉水浊。\r\n侍婢卖珠回，牵萝补茅屋。\r\n摘花不插发，采柏动盈掬。\r\n天寒翠袖薄，日暮倚修竹。',
  masterComment: '《唐诗品汇》：刘云：闲言馀语，无不可感（「世情」四句下）。刘云：似悲似诉。自言自誓，矜持慷慨，修洁端丽，画所不能如，论所不能及（「合昏」八句下）。刘云：字字矜到而不艰棘。尽不容尽（「摘花」四句下）。\r\n《唐诗解》：此诗叙事真切，疑当时实有是人。然其自况之意，盖亦不浅。夫少陵冒险以奔行在，千里从君，可谓忠矣，然肃宗慢不加礼，一论房琯而遂废斥于华州，流离艰苦，采橡栗以食，此与「倚修竹」者何异耶？吁！读此而知唐室待臣之薄也，\r\n《唐诗归》：锺云：卖珠补屋，故家暴贫真境，未经过者以为迂（「侍婢」二句下）。锺云：清境难堪，然自不恶（末二句下）。\r\n《唐诗选脉会通评林》：吴山民曰：语虽浅，当是《谷风》後第一首。「世情」二语，人情万端，可叹，「夫婿」以下六语，写情至此，直可痛哭。周珽曰：以《骚》为经，以《选》为纬，高踞汉魏之顶。郭浚曰：转折流美，又极凄怨。陆时雍曰：「在山」二句，语何自持；「天寒」二句，益更矜重，端人不作佻语。\r\n《唐诗快》：题衹「佳人」二字耳，初未尝云「叹佳人」、「惜佳人」也，然篇中可胜叹惜乎？此诗盖为佳人而发，但不知作者果为佳人否？则观者果当作佳人观否？请试参之。衹此二语，令人凄然欲泪（首二句下）。「自云」二字亦伤心（「自云」句下）。伤心（「零落」四句下）。可哭（「那闻」句下）。悄然（末二句下）。\r\n《杜诗说》：末二语嫣然有韵，本美其幽闲贞静之意，却尤半点道学气。\r\n《茧斋诗谈》：「在山泉水清，出山泉水浊」，古腰锁法，云横山腰，似断不断，此所以妙。\r\n《唐诗别裁》：结处衹用写景，不更着议论，而清洁贞正意，自隐然言外，诗格最超。\r\n《杜诗镜铨》：接转，又插一喻，语浅义深，逼真汉魏乐府神理（「在山」四句下）。入李云；落落穆穆，写出幽真本色（「摘花」二句下）。\r\n《读杜心解》：「在山清」、「出山浊」，可谓贞士之心，化人之舌矣。建安而下，齐、梁而上，无此见道语。衹以写景作结，脱尽色相。\r\n《网师园唐诗笺》：「在山泉水清」至末，落落写来，不着议论，而神韵弥隽。\r\n《诗法简易录》：忽入比喻对偶句，气则停蓄，调则高起，最妙（「在山」一联下）。\r\n《超纯斋诗词》：「佳人」并非写实，衹是一种寄託，可能是诗人自己的身影。虽时世艰难，多遭不幸，仍不愿入染浊流。',
  workId: 10466,
  title: '佳人',
  authorId: '57b8fc225bbb50005b7801ea',
  kind: 'shi',
  translation: '一位容貌绝伦美丽女人，孤独地住在幽深的山谷。\r\n自称出身名门清白女子，飘零沦落在荒山野林中。\r\n当年关中一带战火连天，自己的兄弟也惨遭杀戮。\r\n官高禄厚又有什么用处，连骸骨都没能收进坟墓。\r\n世俗人情厌恶衰败的人，万事就像那摇曳的烛光。\r\n薄情寡义的丈夫厌弃我，爱上貌美如玉美丽新妇。\r\n合欢花到了晚上就闭合，鸳鸯鸟双栖不隻身独宿。\r\n丈夫眼裏衹有新人笑容，哪听得到我的悲伤啼哭。\r\n大山裏的泉水清澈明亮，出山後泉水就染上污浊。\r\n等待侍女变卖珍珠回来，牵起藤萝修补破漏茅屋。\r\n不去采摘鲜花装饰鬓发，喜爱翠柏坚贞尽情摘采。\r\n寒风吹动我薄薄的衣衫，日落黄昏我斜倚着青竹。',
  intro: '此诗写一个乱世佳人被丈夫遗弃，幽居空谷，艰难度日的不幸遭遇。她出身良家，然而生不逢时，在安史战乱中，原来官居高位的兄弟惨遭杀戮，丈夫见她娘家败落，就遗弃了她，于是她在社会上流落无依。然而，她没有被不幸压倒没有向命运屈服；她咽下生活的苦水，幽居空谷，与草木为邻，立志守节，宛若山泉。此诗讴歌的就是这种贫贱不移，贞节自守的精神。全诗文笔委婉，缠绵悱恻，绘声如泣如诉，绘影楚楚动人。「在山泉水清，出山泉水浊」二句深寓生活哲理。',
  authorDesc: '杜甫，字子美，自号少陵野老，世称“杜工部”、“杜老”、“杜少陵”等，盛唐时期伟大的现实主义诗人。汉族，巩县（今河南巩义）人。杜甫曾祖父起由湖北襄阳迁居巩县。他忧国忧民，人格高尚，约1400余首诗被保留了下来，诗艺精湛，在中国古典诗歌中的影响非常深远，备受推崇。759-766年间曾居成都，后世有杜甫草堂纪念之。杜甫被世人尊为“诗圣”，其诗被称为“诗史”。杜甫与李白合称“李杜”，为了和李商隐与杜牧即“小李杜”区别开，杜甫与李白又合称“大李杜”。',
  annotation: '绝代：冠绝当代，举世无双。\r\n佳人：貌美的女子。\r\n幽居：静处闺室，恬淡自守。\r\n空谷：一作「山谷」。\r\n零落：飘零沦落。\r\n依草木：住在山林中。\r\n关中：指函谷关以西的地区，这裏指长安。\r\n丧乱：一作「丧败」，死亡和祸乱，指遭逢安史之乱。\r\n官高：指娘家官阶高。\r\n骨肉：指遭难的兄弟。\r\n转烛：烛火随风转动，比喻世事变化无常。\r\n夫壻：丈夫。\r\n新人：指丈夫新娶的妻子。\r\n美如玉：一作「已如玉」。\r\n合昏：夜合花，叶子朝开夜合。\r\n鸳鸯：水鸟，雌雄成对，日夜形影不离。\r\n旧人：佳人自称。\r\n卖珠：因生活穷困而卖珠宝。\r\n牵萝：拾取树藤类枝条。也是写佳人的清贫。\r\n插发：一作「插髻」，一作「插鬢」。\r\n采柏：采摘柏树叶。\r\n动：往往\r\n盈掬：一作「盈握」。\r\n修竹：高高的竹子。喩佳人高尚的节操。',
}
const test1 = {
  objectId: '57b8fc507db2a20054267d22',
  title: '兰亭集序',
  dynasty: '晋',
  authorName: '王羲之',
  authorId: '57b8fc225bbb50005b7801ea',
  kindCN: '文',
  kind: 'wen',
  layout: 'indent',
  baiduWiki: 'http://baike.baidu.com/subview/6850/17409556.htm',
  authorDesc: '王羲之，东晋书法家，字逸少，号澹斋，汉族，原籍山东琅琊（今山东临沂），后迁居会稽（绍兴），写下《兰亭集序》，晚年隐居会稽下辖剡县金庭，中国东晋书法家，有书圣之称。历任秘书郞、宁远将军、江州刺史。后为会稽内史，领右将军，人称“王右军”、“王会稽”。其子王献之书法亦佳，世人合称为“二王”。此后历代王氏家族书法人才辈出。东晋升平五年卒，葬于金庭瀑布山（又称紫藤山），其五世孙衡舍宅为金庭观，遗址犹存。',
  content: '永和九年，岁在癸丑，暮春之初，会于会稽山阴之兰亭，修禊事也。群贤毕至，少长咸集。此地有崇山峻岭，茂林修竹，又有清流激湍，映带左右，引以为流觞曲水，列坐其次。虽无丝竹管弦之盛，一觞一咏，亦足以畅叙幽情。\r\n是日也，天朗气清，惠风和畅。仰观宇宙之大，俯察品类之盛，所以游目骋怀，足以极视听之娱，信可乐也。\r\n夫人之相与，俯仰一世。或取诸怀抱，悟言一室之内；或因寄所托，放浪形骸之外。虽趣舍万殊，静躁不同，当其欣于所遇，暂得于己，怏然自足，不知老之将至。及其所之既倦，情随事迁，感慨系之矣。向之所欣，俯仰之间，以为陈迹，犹不能不以之兴怀，况修短随化，终期于尽！古人云：“死生亦大矣。”岂不痛哉！\r\n每揽昔人兴感之由，若合一契，未尝不临文嗟悼，不能喻之于怀。固知一死生为虚诞，齐彭殇为妄作。后之视今，亦由今之视昔，悲夫！故列叙时人，录其所述。虽世殊事异，所以兴怀，其致一也。后之揽者，亦将有感于斯文。',
  translation: '永和九年，时在癸丑之年，三月上旬，我们会集在会稽郡山阴城的兰亭，为了做禊事。众多贤才都汇聚到这里，年龄大的小的都聚集在这里。兰亭这个地方有高峻的山峰，茂盛的树林，高高的竹子。又有清澈湍急的溪流，辉映环绕在亭子的四周，我们引溪水作为流觞的曲水，排列坐在曲水旁边，虽然没有演奏音乐的盛况，但喝点酒，作点诗，也足够来畅快叙述幽深内藏的感情了。\r\n这一天，天气晴朗，空气清新，和风温暖，仰首观览到宇宙的浩大，俯看观察大地上众多的万物，用来舒展眼力，开阔胸怀，足够来极尽视听的欢娱，实在很快乐。\r\n人与人相互交往，很快便度过一生。有的人在室内畅谈自己的胸怀抱负；有的人就着自己所爱好的事物，寄托情怀，放纵无羁地生活。虽然各有各的爱好，安静与躁动各不相同，但当他们对所接触的事物感到高兴时，一时感到自得和满足，竟然不知道衰老将要到来。等到对得到或喜爱的东西已经厌倦，感情随着事物的变化而变化，感慨随之产生。过去所喜欢的东西，转瞬间，已经成为旧迹，尚且不能不因为它引发心中的感触，况且寿命长短，听凭造化，最后归结于消灭。古人说：“死生毕竟是件大事啊。”怎么能不让人悲痛呢？\r\n每当看到前人所发感慨的原因，其缘由像一张符契那样相和，总难免要在读前人文章时叹息哀伤，不能明白于心。本来知道把生死等同的说法是不真实的，把长寿和短命等同起来的说法是妄造的。后人看待今人，也就像今人看待前人，可悲呀。所以一个一个记下当时与会的人，录下他们所作的诗篇。纵使时代变了，事情不同了，但触发人们情怀的原因，他们的思想情趣是一样的。后世的读者，也将对这次集会的诗文有所感慨。',
  intro: '《兰亭集序》又名《兰亭宴集序》、《兰亭序》。东晋穆帝永和九年（公元353年）三月三日，王羲之与谢安、孙绰等四十一位军政高官，在山阴（今浙江绍兴）兰亭「修禊」，会上各人做诗，《兰亭集序》即为王羲之为众人所作之诗写的序文手稿。文中记叙了兰亭山水之美和聚会的畅快之情，抒发作者对生死无常的感慨。\r\n王羲之手书之真迹已随唐太宗葬于墓中，后人只得由临本中窥见此作。而其临本中又以「神龙本」《兰亭集序》最为称道，因该卷画心前上有唐中宗「神龙」年号小印左半印迹而得名，被认定为是由冯承素奉圣旨于兰亭真迹上双钩所摹，所以应是与真迹最为接近的摹本。本文内容即以《兰亭集序》「神龙摹本」为准。',
  annotation: '永和：东晋穆帝司马聃的年号，从公元345—356年共十二年。永和九年上巳节，王羲之与谢安，孙绰等四十一人。举行禊礼，饮酒赋诗，事后将作品结为一集，由王羲之写了这篇序总述其事。\r\n暮春：阴历三月。暮，晚。\r\n会：集会。\r\n会稽（kuàijī）：郡名，今浙江绍兴。\r\n山阴：今绍兴越城区。\r\n修禊（xì）事也：（为了做）禊礼这件事。古代习俗，于阴历三月上旬的巳日（魏以后定为三月三日），人们群聚于水滨嬉戏洗濯，以祓除不祥和求福。实际上这是古人的一种游春活动。修禊，《兰亭集序》的神龙摹本作“脩稧”。\r\n群贤：诸多贤士能人。指谢安等三十二位社会的名流。贤，形容词做名词。\r\n毕至：全到。毕，全、都。\r\n少长：如王羲之的儿子王凝之、王徽之是少；谢安、王羲之等是长。\r\n咸：都。\r\n崇山峻岭：高峻的山岭。岭，《兰亭集序》的神龙摹本作“领”。\r\n修竹：高高的竹子。修，高高的样子。\r\n激湍：流势很急的水。\r\n映带左右：辉映点缀在亭子的周围。映带，映衬、围绕，《兰亭集序》的神龙摹本作“暎”。\r\n流觞曲（shāngqū）水：用漆制的酒杯盛酒，放入弯曲的水道中任其飘流，杯停在某人面前，某人就引杯饮酒。这是古人一种劝酒取乐的方式。流，使动用法；曲水，引水环曲为渠，以流酒杯。\r\n列坐其次：列坐在曲水之旁。列坐，排列而坐；次，旁边，水边。\r\n丝竹管弦之盛：演奏音乐的盛况。盛，盛大。\r\n一觞一咏：喝着酒作着诗。\r\n幽情：幽深内藏的感情。\r\n是日也：这一天。\r\n惠风：和风。\r\n和畅，缓和。\r\n品类之盛：万物的繁多。品类，指自然界的万物。\r\n所以：用来。\r\n骋：使……奔驰。\r\n极：穷尽。\r\n信：实在。\r\n夫人之相与，俯仰一世：人与人相交往，很快便度过一生。夫，句首发语词，不译。相与，相处、相交往。俯仰，表示时间的短暂。\r\n取诸：取之于，从……中取得。\r\n悟言：面对面的交谈。悟，通“晤”，指心领神会的妙悟之言。\r\n因寄所托，放浪形骸之外：就着自己所爱好的事物，寄托自己的情怀，不受约束，放纵无羁的生活。因，依、随着。寄，寄托。所托，所爱好的事物。放浪，放纵、无拘束。形骸，身体、形体。\r\n趣（qǔ）舍万殊：各有各的爱好。趣舍，即取舍，爱好。趣，通“取”。万殊，千差万别。\r\n静躁：安静与躁动。\r\n暂：短暂，一时。\r\n怏然自足：自大自满的样子。然，……的样子。中学教科书中“怏”字讹作“快”，不可取。\r\n不知老之将至：（竟）不知道衰老将要到来。语出《论语·述而》：“其为人也，发愤忘食，乐以忘忧，不知老之将至云尔。”一本有“曾”在句前。\r\n所之既倦：（对于）所喜爱或得到的事物已经厌倦。之，往、到达。\r\n情随事迁：感情随着事物的变化而变化。迁，变化。\r\n感慨系之：感慨随着产生。系，附着。\r\n向：过去、以前。\r\n以为陈迹：中学教科书中讹“以”字为“已”，今正之。\r\n陈迹：旧迹。\r\n以之兴怀：因它而引起心中的感触。以，因。之，指“向之所欣……以为陈迹”。兴，发生、引起。\r\n修短随化：寿命长短听凭造化。化，自然。\r\n期：至，及。\r\n死生亦大矣：死生是一件大事啊。语出《庄子·德充符》。\r\n契：符契，古代的一种信物。在符契上刻上字，剖而为二，各执一半，作为凭证。\r\n临文嗟（jiē）悼：读古人文章时叹息哀伤。临，面对。\r\n喻：明白。\r\n固知一死生为虚诞，齐彭殇为妄作：本来知道把死和生等同起来的说法是不真实的，把长寿和短命等同起来的说法是妄造的。固，本来、当然。一，把……看作一样；齐，把……看作相等，都用作动词。虚诞，虚妄荒诞的话。殇，未成年死去的人。妄作，妄造、胡说。一生死，齐彭殇，都是庄子的看法。出自《齐物论》。\r\n亦由今之视昔：中学教科书中将“由”字讹作“犹”，不可取。\r\n列叙时人：一个一个记下当时与会的人。\r\n录其所述：录下他们作的诗。\r\n其致一也：人们的思想情趣是一样的。\r\n后之揽者：后世的读者。\r\n斯文：这次集会的诗文。',
  masterComment: '金圣叹《天下才子必读书》卷九：此文一意反复生死之事甚疾，现前好景可念，更不许顺口说有妙理妙语，真古今第一情种也。\r\n李兆洛《骈体文钞》卷二十一：雅人深致，玩其抑扬之趣。\r\n吴楚材、吴调侯《古文观止》卷七：通篇着眼在死生二字。只为当时士大夫务清谈，鲜实效。一死生而齐彭疡，无经济大略，故触景兴怀，俯仰若有余病。但逸少旷达人，故虽苍凉感叹之中，自有无穷逸趣。\r\n浦起龙《古文眉诠》卷四十二：非止序禊事也，序诗意也。修短死生，皆一时诗意所感，故其言如此。笔情绝俗，高出选体。\r\n余诚《重汀古文释义新编》卷七：因游宴之乐，写人生死之可悲，则兰亭一会，固未可等诸寻常小集。而排斤当日竟尚清谈；倾惑朝廷者之意，亦寓言下。林西仲谓古人游览之文，亦不苟作如此。信非诬也。至其文情之高旷，文致之轻松，更难备述。',
  appreciation: '文描绘了兰亭的景致和王羲之等人集会的乐趣，抒发了作者盛事不常、“修短随化，终期于尽”的感叹。作者时喜时悲，喜极而悲，文章也随其感情的变化由平静而激荡，再由激荡而平静，极尽波澜起伏、抑扬顿挫之美，所以《兰亭集序》才成为名篇佳作。全文共三段。\r\n文章首段记叙兰亭聚会盛况，并写出与会者的深切感受。先点明聚会的时间、地点、缘由，后介绍与会的人数之多，范围之广，“群贤毕至，少长咸集”。接着写兰亭周围优美的环境。先写高远处：“崇山峻岭，茂林修竹”；再写近低处“清流激湍”；然后总写一笔：“映带左右”。用语简洁。富有诗情画意。在写景的基础上，由此顺笔引出临流赋诗，点出盛会的内容为“一觞一咏”，“畅叙幽情”，“虽无丝竹管弦之盛”，这是反面衬托之笔，以加强表达赏心悦目之情。最后指出盛会之日正逢爽心怡人的天时，“天朗气清”为下文的“仰观”、“俯察”提供了有利条件；“惠风和畅”又与“暮春之初”相呼应。此时此地良辰美景，使“仰观”、“俯察”，“游目骋怀”、“视听之娱”完全可以摆脱世俗的苦恼，尽情地享受自然美景，抒发自己的胸臆。至此，作者把与会者的感受归结到“乐”字上面。笔势疏朗简净，毫无斧凿痕迹。\r\n文章第二段，阐明作者对人生的看法，感慨人生短哲，盛事不常，紧承上文的“乐”字，引发出种种感慨。先用两个“或”字，从正反对比分别评说“人之相与，俯仰一世”的两种不同的具体表现，一是“取诸怀抱，晤言一室之内”，一是“因寄所托，放浪形骸之外”。然后指出这两种表现尽管不同，但心情却是一样的。那就是“当其欣于所遇”时，都会“快然自足”，却“不知老之将至”。这种感受，正是针对正文“游目骋怀，足以极视听之娱”的聚会之乐而发，侧重写出乐而忘悲。接着由“欣于其所遇”的乐引出“情随事迁”的忧，写出乐而生忧，发出“修短随化，终期于尽”的慨叹、文章至此，推进到生死的大问题。最后引用孔子所说的“死生亦大矣”一句话来总结全段，道出了作者心中的“痛”之所在。\r\n最后一段说明作序的缘由。文章紧承上文“死生亦大矣”感发议论，从亲身感受谈起，指出每每发现“昔人兴感之由”和自己的兴感之由完全一样，所以“未尝不临文嗟悼”，可是又说不清其中原因。接着把笔锋转向了对老庄关于“一生死”，“齐彭殇”论调的批判，认为那完全是“虚诞”和“妄作”。东晋时代的文人士大夫崇尚老庄，喜好虚无土义的清谈，庄子认为自然万物“方生方死，方死方生”（《庄子·齐物论》），且把长寿的彭祖和夭折的儿童等同看待，认为“莫寿于殇子，而彭祖为夭”。作者能与时风为悖。对老庄这种思想的大胆否定，是难能可贵的，然后作者从由古到今的事实中做了进一步的推断：“后之视今，亦由今之视昔”。基于这种认识，所以才“列叙时人，录其所述”，留于后人去阅读。尽管将来“事殊事异”，但“所以兴怀。其一致也”。这就从理论上说清了所以要编《兰亭诗集》的原因。最后一句，交代了写序的目的，引起后人的感怀。文字收束得直截了当，开发的情思却绵绵不绝。\r\n这篇序言疏朗简净而韵味深长，突出地代表了王羲之的散文风格。且其造语玲珑剔透，琅琅上口。是古代骈文的精品。《兰亭集序》在骈文的几个方面都有所长。在句法上，对仗整齐，句意排比，如“群贤毕至，少长咸集”，“仰观宇庙之大。俯察品类之盛”，“或取诸怀抱，晤言一室之内；或因寄所托，放浪形骸之外”，两两相对，音韵和谐，无斧凿之痕，语言清新、朴素自然。属于议论部分的文字也非常简沽，富有表现力，在用典上也只用“齐彭殇”和“修楔事”这样浅显易储的典故，这样朴素的行文与东晋对代雕章琢句，华而不实的文风形成鲜明对照。\r\n这篇文章体现了王羲之积极入世的人生观，和老庄学说主张的无为形成了鲜明的对比。',
}

function close() {
  showMetaDetail.value = false
}

const authorTitle = computed(() => {
  return `[${baseInfo?.dynasty}]${baseInfo?.author?.name}`
})

function seperateByLine(content: string | undefined) {
  if (!content)
    return []
  return content.split('\n')
}
const mainContentStyle = computed(() => {
  if (baseInfo?.layout === 'indent')
    return 'intent-style'
  return 'center-style'
})

function ifTabIsEmpty(tab: string | undefined) {
  return !tab || tab.trim() === ''
}
</script>

<template>
  <div p5 flex="~ col center" relative font-serif>
    <div absolute top-4 right-4 flex="~ gap-3">
      <button icon-btn @click="close">
        <div i-carbon-close />
      </button>
    </div>

    <p text-xl ml1 font-serif>
      <b>{{ baseInfo?.title }}</b>
    </p>

    <p text-md my2>
      {{ authorTitle }}
    </p>

    <p v-for="(eachP, index) in seperateByLine(baseInfo?.content)" :key="index" :class="[mainContentStyle]">
      {{ eachP }}
    </p>

    <div bg-base p2 flex="~ center col" text-base mt-2>
      <n-tabs type="bar" justify-content="center" w-364px pane-class="pane-style">
        <n-tab-pane v-if="!ifTabIsEmpty(baseInfo?.author?.desc)" name="author" tab="作者">
          <card-tab :content="baseInfo?.author?.desc" />
        </n-tab-pane>
        <n-tab-pane v-if="!ifTabIsEmpty(baseInfo?.annotation)" name="annotation" tab="注释">
          <card-tab :content="baseInfo?.annotation" :if-need-strong="true" />
        </n-tab-pane>
        <n-tab-pane v-if="!ifTabIsEmpty(baseInfo?.translation)" name="translation" tab="白话">
          <card-tab :content="baseInfo?.translation" />
        </n-tab-pane>
        <n-tab-pane v-if="!ifTabIsEmpty(baseInfo?.masterComment)" name="commentShort" tab="短评">
          <card-tab :content="baseInfo?.masterComment" :if-need-strong="true" />
        </n-tab-pane>
        <n-tab-pane v-if="!ifTabIsEmpty(baseInfo?.appreciation)" name="commentLang" tab="长评">
          <card-tab :content="baseInfo?.appreciation" />
        </n-tab-pane>
      </n-tabs>
    </div>

    <button btn mt-2 mb-4 @click="close">
      知道了
    </button>
  </div>
</template>

<style lang="scss" scoped>
.pre-wrap {
  white-space: pre-wrap
}

.intent-style {
  @extend.pre-wrap;
  max-width: 340px;
  line-height: 1.9;
  text-indent: 1.5em;
}

.center-style {
  @extend.pre-wrap;
  max-width: 100vw;
  line-height: 1.9;
  text-align: center;
  margin-left: 0.6rem;
}

.pane-style {
  margin-top: 4px;
  border-top: 1px dashed #cccccc30;
  border-bottom: 1px dashed #cccccc30;
  padding: 3px;
}
</style>
